trace3_default.log
INFO 12-05 07:49:46 [__init__.py:244] Automatically detected platform rocm.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=3, model='/home/public/model2/DeepSeek-V3-0324-BF16-Cast-To-Blockwise-Int8/', tokenizer=None, use_beam_search=False, num_prompts=3, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=129, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 3

  0%|          | 0/3 [00:00<?, ?it/s]
 33%|███▎      | 1/3 [01:01<02:03, 61.61s/it]
100%|██████████| 3/3 [01:01<00:00, 20.57s/it]
============ Serving Benchmark Result ============
Successful requests:                     3         
Benchmark duration (s):                  61.71     
Total input tokens:                      384       
Total generated tokens:                  3072      
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         49.78     
Total Token throughput (tok/s):          56.01     
---------------Time to First Token----------------
Mean TTFT (ms):                          745.06    
Median TTFT (ms):                        851.56    
P99 TTFT (ms):                           937.10    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          59.55     
Median TPOT (ms):                        59.47     
P99 TPOT (ms):                           59.79     
---------------Inter-token Latency----------------
Mean ITL (ms):                           59.55     
Median ITL (ms):                         57.32     
P99 ITL (ms):                            103.41    
==================================================