trace4_default.log
INFO 12-05 07:53:37 [__init__.py:244] Automatically detected platform rocm.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=4, model='/home/public/model2/DeepSeek-V3-0324-BF16-Cast-To-Blockwise-Int8/', tokenizer=None, use_beam_search=False, num_prompts=4, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=129, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4

  0%|          | 0/4 [00:00<?, ?it/s]
 25%|██▌       | 1/4 [01:20<04:00, 80.26s/it]
100%|██████████| 4/4 [01:20<00:00, 15.22s/it]
100%|██████████| 4/4 [01:20<00:00, 20.09s/it]
============ Serving Benchmark Result ============
Successful requests:                     4         
Benchmark duration (s):                  80.38     
Total input tokens:                      512       
Total generated tokens:                  4096      
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         50.96     
Total Token throughput (tok/s):          57.33     
---------------Time to First Token----------------
Mean TTFT (ms):                          747.27    
Median TTFT (ms):                        820.79    
P99 TTFT (ms):                           911.83    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          77.79     
Median TPOT (ms):                        77.74     
P99 TPOT (ms):                           78.02     
---------------Inter-token Latency----------------
Mean ITL (ms):                           77.79     
Median ITL (ms):                         75.60     
P99 ITL (ms):                            119.93    
==================================================